{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "url": "https://bobbyjack.me/2019/10/07/ori-and-the-blind-forest-demo",
    "datePublished": "2019-10-07",
    "dateCreated": "2019-10-07",
    "dateModified": "2022-01-05",
    "name": "One Hour Review: Ori and the Blind Forest Demo",
    "author": {
        "@type": "Person",
        "name": "Bobby Jack"
    },
    "abstract": "Gorgeous audio/visuals and a promising adventure, but I end up on the fence",
    "words": [
        "ori and the blind forest demo",
        "gorgeous audio/visuals and a promising adventure, but i end up on the fence",
        "decent demo",
        "i played",
        "ori",
        "for a bit over an hour; the reasons were both good and\n    bad. first off, i definitely enjoyed myself, and wanted to play to the end of\n    the demo, so i’d start by rating it as at least a",
        "on that basis. it could definitely be completed in less time, but it feels like a ‘good chunk of an hour’ long, which fits this series perfectly.",
        "cinematic",
        "the reason it took me a while, though, was because of the — admittedly,",
        "— intro. i didn’t realise you could skip this, so went through it at least once, unnecessarily. and it takes a while — i wasn’t quite sure whether it actually",
        "was",
        "the game, at first. i also think that you can’t resume the demo later on from a save point, which is a pretty big flaw.",
        "familiarity",
        "however, that aside, once i got into the game, i recognised it as a classic metroidvania with many standard elements: wall jump power-up, unlocking gates, etc. actually, this feeling of",
        "did leave me feeling a little flat, but i’ve already immersed myself in",
        "hollow knight",
        "this year, and i’ve played a fair bit of",
        "steamworld dig 2",
        "and",
        "gato roboto",
        "to boot, so maybe my personal metroidvania mania is on the wane.",
        "repetitive",
        "beyond the graphics and soundtrack, i didn’t feel like this game was anything special. i didn’t see anything here i haven’t already seen in the aforementioned titles. i realise that depends on the release order on the switch, and if you played",
        "first, you might find",
        "too",
        ", but that’s the point, really: even as a big metroidvania fan, i don’t find myself pulled in by this game. in fact, from a superficial point of view, i'm more looking forward to playing",
        "xeodrifter",
        "(it’s on the backlog!)",
        "easy",
        "the platforming here felt really ‘loose’ and ‘floaty’ — a bit like",
        "rayman legends",
        "— which is not a style i’m particularly fond of. the camera is quite far away from the main character during normal play, and this means some of the detailed animation on that sprite goes to waste a bit, which is a shame. the combat felt quite prosaic, and a bit",
        ", although the platforming near the end of the demo got a bit more inventive.",
        "enjoyable",
        "overall, a bit like the intro i thought might’ve actually been the game,",
        "feels a bit like it might be all about the ‘cinematics’ and less about challenging, exciting gameplay. it certainly feels",
        ", i’m just not sure if that’s enough for the demo to convince me to shell out for the full game."
    ]
}