{
    "@context": "http://schema.org",
    "@type": "Review",
    "url": "https://bobbyjack.me/2020/03/07/lola-the-escape",
    "datePublished": "2020-03-07",
    "dateCreated": "2020-03-07",
    "dateModified": "2022-01-05",
    "name": "One Hour Review: Lola - The Escape Demo",
    "author": {
        "@type": "Person",
        "name": "Bobby Jack"
    },
    "itemReviewed": {
        "@type": "VideoGame",
        "name": "One Hour Review: Lola - The Escape Demo",
        "gamePlatform": "Nintendo Switch",
        "reviewBody": "A bitesize adventure platformer with lots of character"
    },
    "words": [
        "lola — the escape demo",
        "played on: mac, via",
        "itch.io",
        "a bitesize adventure platformer with lots of character",
        "early",
        "this is a very early-stage demo: no music or sound, no settings: just the one level to get on with. this also mean the constant on-screen presence of button overlays, which are presumably something to do with a possible touch-screen build.",
        "mini-metroidvania",
        "the game itself — at least, this level — is a simple platformer with three controls: left, right, jump. some areas get unlocked and there’s at least one hidden shortcut. you can immobilise some enemies, but combat is totally absent: this is a platformer all about avoiding danger.",
        "floaty",
        "in addition to the basics, lola can float when the jump button is held — this is an essential move to avoid certain obstacles. it’s not a common mechanic, but it works really well here.",
        "gato roboto",
        "aspects of this demo reminded me of",
        ", and it shares a similar charm; i’m not sure quite how far it will push the metroidvania aspect in the full game, but the planned 36 levels should result in a good-sized challenge.",
        "character",
        "visually, the game is very",
        "super mario world",
        "-esque, and the main character lola is full of character: her death animation is hilarious the first time you see it! all round, the game looks great, and i particularly liked the dimly-lit room shown in the screenshot. in fact, in gameplay terms too, that room was probably the highlight of the level.",
        "challenge",
        "the overall challenge is set at a good level, and it’s a promising start for this delightful concept.",
        "lola — the escape is being developed by",
        "hujiol games",
        "."
    ]
}