{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "url": "https://bobbyjack.me/2019/10/18/about-1derlust",
    "datePublished": "2019-10-18",
    "dateCreated": "2019-10-18",
    "dateModified": "2022-01-05",
    "name": "About 1derlust",
    "author": {
        "@type": "Person",
        "name": "Bobby Jack"
    },
    "abstract": "1derlust is a game. A rather silly one, certainly; and incredibly simple one, undoubtedly — I’ve described it as making “Pong look like Breath of the Wild”, which is only a small exaggeration. But, nevertheless, it is a game.",
    "words": [
        "about 1derlust",
        "1derlust is a game",
        ". a rather silly one, certainly; and incredibly simple one, undoubtedly — i’ve described it as making “",
        "pong",
        "look like",
        "breath of the wild",
        "”, which is only a small exaggeration. but, nevertheless, it",
        "is",
        "a game.",
        "the game arose out of two thoughts: a) what would a 1-dimensional game be like? b) will i ever manage to get something,",
        "anything",
        ", finished and released, no matter how trivial it might be? i’m delighted to be in a position where both of those questions are answered, sort of.",
        "gameplay",
        "you play a white square, destined to bounce across the screen from left-to-right and back again, for all eternity. or until you die. score points by pressing a key (or tapping the screen) when your piece is over the checkered target (finish line?), at which point the target will regenerate elsewhere. as you play, speed and acceleration will gradually increase, whilst the targets themselves will shrink over time.",
        "and that’s it, really. go for your own personal high score: 110 is my record so far.",
        "future",
        "i’m not really expecting to develop this much further, but there",
        "are",
        "two possible next steps:",
        "further development",
        "if there is enough (i.e. any) interest in the game at all, i’ll consider some low-key maintainance, and maybe some extra features. i’ve certainly got some ideas for new mechanics, bonus targets, etc. i also think there’s some potential for other ‘1d’ games; maybe i’ll do a series",
        "other games",
        "aside from that, i’m hoping that actually finishing (soft of) a game (sort of) will encourage me to get other, more ambitious projects off the ground. it’s incredibly satisfying releasing something even as basic as 1derlust!",
        "play the game",
        "you can",
        "play 1derlust",
        "(for free, obvs) on desktop or mobile. you can check out the",
        "source code on github",
        "."
    ]
}